Repository: canbyte0/MacSSH
Catalog: MacSSH/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.paste_highlight_help
source: Applies immediately to all local zsh terminals. When on, uses the shell's paste highlighting. Does not affect SSH or bracketed paste protection.
zh_hans: 对所有本地 zsh 终端立即生效。开启时使用 Shell 自身的粘贴高亮，不影响 SSH 或安全粘贴保护。

# settings.read_only_note
source: Settings are read-only in this version.
zh_hans: 本版本设置仅供查看，暂不支持修改。

# settings.scrollback
source: Scrollback
zh_hans: 回滚行数

# settings.scrollback_value
source: 10000 lines
zh_hans: 10000 行

# settings.section.agent
source: AI Agent
zh_hans: AI 助手

# settings.section.appearance
source: Appearance
zh_hans: 外观

# settings.section.general
source: General
zh_hans: 通用

# settings.section.terminal
source: Terminal
zh_hans: 终端

# settings.terminal.highlight.add
source: Add Rule
zh_hans: 添加规则

# settings.terminal.highlight.case_insensitive
source: Case Insensitive
zh_hans: 不区分大小写

# settings.terminal.highlight.case_sensitive
source: Case Sensitive
zh_hans: 区分大小写

# settings.terminal.highlight.color
source: Color
zh_hans: 颜色

# settings.terminal.highlight.color.blue
source: Blue
zh_hans: 蓝色

# settings.terminal.highlight.color.gray
source: Gray
zh_hans: 灰色

# settings.terminal.highlight.color.green
source: Green
zh_hans: 绿色

# settings.terminal.highlight.color.orange
source: Orange
zh_hans: 橙色

# settings.terminal.highlight.color.purple
source: Purple
zh_hans: 紫色

# settings.terminal.highlight.color.red
source: Red
zh_hans: 红色

# settings.terminal.highlight.color.yellow
source: Yellow
zh_hans: 黄色

# settings.terminal.highlight.delete
source: Delete
zh_hans: 删除

# settings.terminal.highlight.empty
source: No highlight rules
zh_hans: 暂无高亮规则

# settings.terminal.highlight.enable
source: Enable Highlighting
zh_hans: 自动高亮

# settings.terminal.highlight.enabled
source: Enabled
zh_hans: 启用

# settings.terminal.highlight.text
source: Text
zh_hans: 文本

# settings.title
source: Settings
zh_hans: 设置

# sftp.column.modified
source: Modified
zh_hans: 修改时间

# sftp.column.name
source: Name
zh_hans: 名称

# sftp.column.permissions
source: Permissions
zh_hans: 权限

# sftp.column.size
source: Size
zh_hans: 大小

# sftp.connection_inactive
source: Connection is inactive. Reconnect to continue.
zh_hans: 连接已断开。请重新连接以继续。

# sftp.connection_lost
source: Connection Lost
zh_hans: 连接丢失

# sftp.copy_path
source: Copy Path
zh_hans: 复制路径

# sftp.delete_message
source: This action cannot be undone.
zh_hans: 此操作无法撤销。

# sftp.delete_named_title
source: Delete “%@”?
zh_hans: 删除“%@”？

# sftp.empty_folder
source: Empty Folder
zh_hans: 空文件夹

# sftp.empty_message
source: This folder is empty.
zh_hans: 该文件夹为空。

# sftp.folder_name
source: Folder name
zh_hans: 文件夹名称

# sftp.item_count.one
source: %lld item
zh_hans: %lld 个项目

# sftp.item_count.other
source: %lld items
zh_hans: %lld 个项目

# sftp.new_folder
source: New Folder
zh_hans: 新建文件夹

# sftp.new_name
source: New name
zh_hans: 新名称

# sftp.operation_failed_title
source: Operation failed
zh_hans: 操作失败

# sftp.parent
source: Parent
zh_hans: 上级

# sftp.rename_ellipsis
source: Rename…
zh_hans: 重命名…

# sftp.ssh_only
source: Files are only available for SSH sessions.
zh_hans: 文件仅对 SSH 会话可用。

# sftp.transfer_unavailable_title
source: Transfer unavailable
zh_hans: 传输不可用

# sftp.unable_to_load
source: Unable to load folder
zh_hans: 无法加载文件夹

# sidebar.hosts
source: Hosts
zh_hans: 主机

# sidebar.local_terminal
source: Terminal
zh_hans: 终端

# sidebar.settings
source: Settings
zh_hans: 设置

# sidebar.transfers
source: Transfers
zh_hans: 传输

# sidebar_right.add
source: Add
zh_hans: 添加

# sidebar_right.add_command
source: New Command
zh_hans: 新增命令

# sidebar_right.add_group
source: New Group
zh_hans: 新增分组

# sidebar_right.clear_history
source: Clear History
zh_hans: 清空历史

# sidebar_right.clear_history_confirm
source: Clear all command history?
zh_hans: 确认清空所有命令历史？

# sidebar_right.clear_history_message
source: This only removes command history. Saved commands and groups are not affected.
zh_hans: 这只会删除命令历史。常用命令和分组不受影响。

# sidebar_right.command_empty
source: Command cannot be empty.
zh_hans: 命令不能为空。

# sidebar_right.command_placeholder
source: Command
zh_hans: 命令

# sidebar_right.command_single_line
source: Command must be a single line.
zh_hans: 命令必须为单行。

# sidebar_right.delete_command
source: Delete Command
zh_hans: 删除命令

# sidebar_right.delete_group
source: Delete Group
zh_hans: 删除分组

# sidebar_right.delete_group_confirm
source: Delete this group?
zh_hans: 确认删除分组？

# sidebar_right.delete_group_message
source: Commands in this group will move to Ungrouped (%lld command(s)).
zh_hans: 分组中的命令将移到未分组（%lld 条命令）。

# sidebar_right.edit
source: Edit
zh_hans: 编辑

# sidebar_right.edit_command
source: Edit Command
zh_hans: 编辑命令

# sidebar_right.execute
source: Run Command
zh_hans: 执行命令

# sidebar_right.group_actions
source: Group Actions
zh_hans: 分组操作

# sidebar_right.group_empty
source: No commands
zh_hans: 暂无命令

# sidebar_right.group_name
source: Group name
zh_hans: 分组名称

# sidebar_right.group_name_empty
source: Group name cannot be empty.
zh_hans: 分组名称不能为空。

# sidebar_right.hide
source: Hide Sidebar
zh_hans: 隐藏侧边栏

# sidebar_right.history
source: History
zh_hans: 历史记录

# sidebar_right.history_disclosure
source: This version records commands run through MacSSH. Commands entered manually in the terminal are not recorded.
zh_hans: 当前版本仅记录通过 MacSSH 执行的命令。 手动在终端输入的命令不会记录。

# sidebar_right.history_empty
source: No command history
zh_hans: 暂无历史记录

# sidebar_right.local
source: Local
zh_hans: 本地

# sidebar_right.paste
source: Paste into Terminal
zh_hans: 粘贴到终端

# sidebar_right.rename
source: Rename
zh_hans: 重命名

# sidebar_right.rename_group
source: Rename Group
zh_hans: 重命名分组

# sidebar_right.resize
source: Resize Sidebar
zh_hans: 调整侧边栏宽度

# sidebar_right.save_history
source: Save command history
zh_hans: 保存命令历史

# sidebar_right.saved_commands
source: Saved Commands
zh_hans: 常用命令

# sidebar_right.saved_empty
source: No saved commands
zh_hans: 暂无常用命令

# sidebar_right.show
source: Show Sidebar
zh_hans: 显示侧边栏

# sidebar_right.ungrouped
source: Ungrouped
zh_hans: 未分组

# status.authenticating
source: Authenticating…
zh_hans: 认证中…

# status.connecting
source: Connecting…
zh_hans: 连接中…

# status.local.active
source: Local · %@
zh_hans: 本地 · %@

# status.local.exited
source: Local · %@ · Exited
zh_hans: 本地 · %@ · 已退出

# status.local.failed_to_start
source: Local · %@ · Failed to Start
zh_hans: 本地 · %@ · 启动失败

# status.local.starting
source: Local · %@ · Starting
zh_hans: 本地 · %@ · 启动中

# status.opening
source: Opening…
zh_hans: 正在打开…

# status.ssh.authenticating
source: SSH · %@ · Authenticating…
zh_hans: SSH · %@ · 认证中…

# status.ssh.closing
source: SSH · %@ · Closing…
zh_hans: SSH · %@ · 正在关闭…

# status.ssh.connecting
source: SSH · %@ · Connecting…
zh_hans: SSH · %@ · 连接中…

# status.ssh.disconnected
source: SSH ○ %@ · Disconnected
zh_hans: SSH ○ %@ · 已断开

# status.ssh.exited
source: SSH · %@ · Exited
zh_hans: SSH · %@ · 已退出

# status.ssh.failed
source: SSH ○ %@ · Failed
zh_hans: SSH ○ %@ · 失败

# status.ssh.opening
source: SSH · %@ · Opening…
zh_hans: SSH · %@ · 正在打开…

# status.ssh.verifying_host
source: SSH · %@ · Verifying Host…
zh_hans: SSH · %@ · 正在验证主机…

# status.transfer_queue
source: Transfer Queue
zh_hans: 传输队列

# status.verifying_host
source: Verifying Host…
zh_hans: 正在验证主机…

# terminal.close
source: Close
zh_hans: 关闭

# terminal.close_named_tab
source: Close tab: %@
zh_hans: 关闭标签页：%@

# terminal.close_tab
source: Close tab
zh_hans: 关闭标签页

# terminal.closing
source: Closing…
zh_hans: 正在关闭…

# terminal.connecting_to
source: Connecting to %@
zh_hans: 正在连接到 %@

# terminal.connection_failed
source: Connection failed
zh_hans: 连接失败

# terminal.connection_failed_message
source: The connection could not be established.
zh_hans: 无法建立连接。

# terminal.connection_lost
source: Connection lost
zh_hans: 连接丢失

# terminal.empty_message
source: Open a new terminal session to start working.
zh_hans: 打开新的终端会话以开始工作。

# terminal.local
source: Terminal
zh_hans: 终端

# terminal.local_tab_accessibility
source: Local terminal tab: %@
zh_hans: 本地终端标签页：%@

# terminal.local_title
source: Terminal
zh_hans: 终端

# terminal.new
source: New Terminal
zh_hans: 新建终端

# terminal.new_local
source: New Local Terminal
zh_hans: 新建本地终端

# terminal.no_sessions
source: No Terminal Sessions
zh_hans: 没有终端会话

# terminal.pane
source: Pane
zh_hans: 面板

# terminal.reconnect
source: Reconnect
zh_hans: 重新连接

# terminal.remote
source: Remote Terminal: %@
zh_hans: 远程终端：%@

# terminal.remote_shell_exited
source: Remote shell exited
zh_hans: 远程 Shell 已退出

# terminal.retry
source: Retry
zh_hans: 重试

# terminal.shell_exited
source: Shell exited
zh_hans: Shell 已退出

# terminal.show_tab
source: Show Tab %lld
zh_hans: 显示标签页 %lld

# terminal.ssh_tab_accessibility
source: SSH terminal tab: %@
zh_hans: SSH 终端标签页：%@

# terminal.title
source: Terminal
zh_hans: 终端

# toolbar.new_local_terminal_help
source: Create a new local terminal session.
zh_hans: 新建一个本地终端会话。

# toolbar.new_session
source: New Session
zh_hans: 新建会话

# transfer.queue.running
source: %lld Transferring
zh_hans: %lld 个进行中

# transfer.queue.waiting
source: %lld Waiting
zh_hans: %lld 个等待中

# transfer.state.cancelled
source: Cancelled
zh_hans: 已取消

# transfer.state.cancelling
source: Cancelling
zh_hans: 正在取消

# transfer.state.completed
source: Completed
zh_hans: 已完成

# transfer.state.failed
source: Failed
zh_hans: 失败

# transfer.state.preparing
source: Preparing
zh_hans: 准备中

# transfer.state.transferring
source: Transferring
zh_hans: 传输中

# transfer.state.waiting
source: Waiting
zh_hans: 等待中

# transfer.state.waiting_for_connection
source: Waiting for connection
zh_hans: 等待连接

# transfers.clear_finished
source: Clear Finished
zh_hans: 清除已完成

# transfers.count.one
source: %lld task
zh_hans: %lld 个任务

# transfers.count.other
source: %lld tasks
zh_hans: %lld 个任务

# transfers.empty_message
source: Upload and download progress appears here once started.
zh_hans: 上传 / 下载开始后，进度会显示在这里。

# transfers.title
source: Transfers
zh_hans: 传输

# validation.highlight_text_required
source: Highlight text is required
zh_hans: 请输入高亮文本

# validation.hostname_required
source: Hostname is required.
zh_hans: 主机名不能为空。

# validation.name_required
source: Name is required.
zh_hans: 名称不能为空。

# validation.port_range
source: Port must be between 1 and 65535.
zh_hans: 端口必须为 1 到 65535。

# validation.private_key_required
source: Choose a private key file.
zh_hans: 请选择私钥文件。

# validation.username_required
source: Username is required.
zh_hans: 用户名不能为空。
